БСП_312/src/Catalogs/ТипыЦен/ТипыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЦен</name>
  <attributes>
    <name>ЦенаКабинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Кабинки</name>
    <attributes>
      <name>Кабинка</name>
      <type>
        <types>CatalogRef.КабинкиЗагара</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БСП_312/src/Catalogs/ТипыЦен/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.КабинкиЗагара.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЦенаКабинкиПриИзменении(Элемент)
	
	Если (Не Объект.ЦенаКабинки
		и Объект.Кабинки.Количество() > 0) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЦенаКабинкиПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Будет очищена табличная часть. Продолжить?", РежимДиалогаВопрос.ДаНет);	 
	Иначе
		УстановитьВидимость();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаКабинкиПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если (РезультатВопроса = КодВозвратаДиалога.Да) Тогда
		Объект.Кабинки.Очистить();
		УстановитьВидимость();
	Иначе
		Объект.ЦенаКабинки = Не Объект.ЦенаКабинки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.Кабинки.Видимость = Объект.ЦенаКабинки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ПараметрыОтбора = Новый Структура("Кабинка", ВыбранноеЗначение);
	МассивНайденныхСтрок = Объект.Кабинки.НайтиСтроки(ПараметрыОтбора);  
	Если МассивНайденныхСтрок.Количество() = 0  Тогда
		НовСтр = Объект.Кабинки.Добавить();
		НовСтр.Кабинка = ВыбранноеЗначение;	
	КонецЕсли;
КонецПроцедуры
